// Домашня робота:
// 1 Створення класу та об'єкта:
// Створіть клас Person з властивостями name та age.

function Person(name, age){
    this.name = name;
    this.age = age;
}
// Створіть об'єкт з цього класу з ім'ям "John" та віком 30.

let newPerson = new Person('Jhon', '30');
console.log(newPerson);


// 2 Методи класу:
// Розширте клас Person, додайте метод sayHello, який виводить повідомлення з привітанням та ім'ям особи в console.log

Person.prototype.sayHello = function() {
    return `Hello, ${this.name}`;
    
}
console.log(newPerson.sayHello());

// 3 Наслідування:
// Створіть клас Student, який наслідує від класу Person.
// Додайте властивість studentId до класу Student.
// Додайте метод study, який виводить повідомлення про студента

class Person1{
    constructor(name, age){
        this._name = name;
        this._age = age;
    }
}

class Student extends Person1 {
    constructor(name, age, studentId){
          super(name, age);
          this._studentId = studentId;

    }
    study (){
        console.log(`This is a student ${this._name}`);
    }  

}
let student = new Student('Jhon', 21, 2547896);

student.study()



////    це мої борги:


// 4 Задачі для практики forEach, reverse  Виведіть значення з масиву в зворотньому порядку
// const numbers = [1, 2, 3, 4, 5];

// 5  Задачі для практики map та Math.round
//  Маєте масив чисел з плаваючою комою. Використовуйте map разом з Math.round, щоб створити новий масив, в якому кожне число буде округлене до найближчого цілого.

// Додаткове завдання:
// 1. Вгадай число
// Гравець має вгадати число, яке програма випадково генерує в заданому діапазоні від 1до 20. Після кожної спроби програма повідомляє, чи є загадане число більшим чи меншим від введеного. Гра триває до вгадування числа 

// 2. Камінь-ножиці-папір
// Гравець вводить свій вибір, а програма генерує власний випадковим чином. Потім визначається переможець за традиційними правилами гри.
// Додаткові матеріали 



// Напишіть функцію, яка використовує forEach для обчислення суми всіх елементів у масиві чисел. Масив наприклад 

// Додаткове завдання:
// Напишіть функцію, яка використовує forEach для створення масиву, що містить лише унікальні елементи вихідного масиву.
// Тобто якщо предаєте numberArr = [10,20,30, 20, 10] отримуєте numberArr = [10,20,30]


// Напишіть функцію, що приймає масив чисел і колбек-функцію. Функція повинна використовувати for...of для обходу по масиву та
// викликати колбек-функцію для кожного елемента. Колбек-функція повинна повертати true або false, вказуючи, чи слід включити поточний елемент до нового масиву.


// Передавши масив  [1, 2, 3, 4, 5] і колбек-функція, що відбирає парні числа.